# -*- coding: utf-8 -*-

import telebot
from telebot.types import InlineKeyboardMarkup, InlineKeyboardButton
import os

TOKEN = os.getenv("BOT_TOKEN") or "PUT_YOUR_BOT_TOKEN_HERE"
bot = telebot.TeleBot(TOKEN, parse_mode="HTML")

# ==================================================
# DATA
# ==================================================

ADHKAR = {

    "morning": [
        {
            "text": "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].",
            "count": 1
        },
        {
            "text": "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.",
            "count": 3
        },
        {
            "text": "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.",
            "count": 3
        },
        {
            "text": "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.",
            "count": 3
        },
        {
            "text": "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.",
            "count": 1
        },
        {
            "text": "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .",
            "count": 1
        },
        {
            "text": "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.",
            "count": 3
        },
        {
            "text": "اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.",
            "count": 4
        },
        {
            "text": "اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.",
            "count": 1
        },
        {
            "text": "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم. ",
            "count": 7
        },
        {
            "text": "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.",
            "count": 3
        },
        {
            "text": "اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور.",
            "count": 1
        },
        {
            "text": "أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.",
            "count": 1
        },
        {
            "text": "أَسُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.",
            "count": 3
        },
        {
            "text": "أَاللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.",
            "count": 3
        },
        {
            "text": "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ. ",
            "count": 3
        },
        {
            "text": "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي. ",
            "count": 1
        },
        {
            "text": "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ. ",
            "count": 3
        },
        {
            "text": "أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه. ",
            "count": 1
        },
        {
            "text": "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم. ",
            "count": 1
        },
        {
            "text": "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق. ",
            "count": 3
        },
        {
            "text": "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد. ",
            "count": 10
        },
        {
            "text": "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.  ",
            "count": 3
        },
        {
            "text": "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد. ",
            "count": 10
        },
        {
            "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.  ",
            "count": 3
        },
        {
            "text": "أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.  ",
            "count": 3
        },
        {
            "text": "يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ. ",
            "count": 3
        },
        {
            "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا. ",
            "count": 1
        },
        {
            "text": "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ. ",
            "count": 1
        },
        {
            "text": "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ. ",
            "count": 100
        },
        {
            "text": "سُبْحـانَ اللهِ وَبِحَمْـدِهِ. ",
            "count": 100
        },
        {
            "text": "أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ  ",
            "count": 100
        },
      
    
    ],

    "evening": [
        {
            "text": "أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ...",
            "count": 1
        },
    ],

    "tasbeeh": [
        {"text": "سبحان الله", "count": 33},
        {"text": "الحمد لله", "count": 33},
        {"text": "الله أكبر", "count": 34},
    ],

    "istighfar": [
        {"text": "أستغفر الله العظيم وأتوب إليه", "count": 100},
    ],

    # ===== أذكار متنوعة =====
    "sleep": [
        {"text": "بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي", "count": 1},
    ],

    "study": [
        {"text": "اللهم لا سهل إلا ما جعلته سهلاً", "count": 1},
    ],

    "forgotten": [
        {"text": "سبحان الله عدد ما خلق", "count": 3},
    ],

    "prayer": [
        {"text": "اللهم أعني على ذكرك وشكرك وحسن عبادتك", "count": 1},
    ],
}

# ==================================================
# USER STATE
# ==================================================

USER_STATE = {}
# user_id : { section, index, remaining }

# ==================================================
# KEYBOARDS
# ==================================================

def main_menu():
    kb = InlineKeyboardMarkup(row_width=1)
    kb.add(
        InlineKeyboardButton("🌅 أذكار الصباح", callback_data="morning"),
        InlineKeyboardButton("🌙 أذكار المساء", callback_data="evening"),
        InlineKeyboardButton("📿 تسبيح", callback_data="tasbeeh"),
        InlineKeyboardButton("🕊️ استغفار", callback_data="istighfar"),
        InlineKeyboardButton("✨ أذكار متنوعة", callback_data="misc"),
    )
    return kb


def misc_menu():
    kb = InlineKeyboardMarkup(row_width=1)
    kb.add(
        InlineKeyboardButton("🌙 أذكار النوم", callback_data="sleep"),
        InlineKeyboardButton("📚 أذكار المذاكرة", callback_data="study"),
        InlineKeyboardButton("🕯️ أذكار مهجورة", callback_data="forgotten"),
        InlineKeyboardButton("🕌 أذكار الصلاة", callback_data="prayer"),
        InlineKeyboardButton("⬅️ رجوع", callback_data="back"),
    )
    return kb


def counter_kb(remaining):
    kb = InlineKeyboardMarkup()
    kb.add(
        InlineKeyboardButton(f"📿 {remaining} متبقي", callback_data="count")
    )
    return kb

# ==================================================
# CORE LOGIC
# ==================================================

def start_section(chat_id, uid, section):
    USER_STATE[uid] = {
        "section": section,
        "index": 0,
        "remaining": ADHKAR[section][0]["count"]
    }
    send_current_dhikr(chat_id, uid)


def send_current_dhikr(chat_id, uid):
    state = USER_STATE[uid]
    dhikr = ADHKAR[state["section"]][state["index"]]

   bot.send_message(
    chat_id,
    f"﴿ {dhikr['text']} ﴾",  # مجرد نص عادي
    parse_mode="HTML",         # لو عايز تعمل bold لكلمات معينة
    reply_markup=counter_kb(state["remaining"])
)



def next_dhikr(chat_id, uid):
    state = USER_STATE[uid]
    state["index"] += 1

    if state["index"] >= len(ADHKAR[state["section"]]):
        bot.send_message(chat_id, "🤍 <b>تقبل الله منا ومنكم صالح الاعمال</b>")
        del USER_STATE[uid]
        return

    state["remaining"] = ADHKAR[state["section"]][state["index"]]["count"]
    send_current_dhikr(chat_id, uid)

# ==================================================
# HANDLERS
# ==================================================

@bot.message_handler(commands=["start"])
def start(m):
    bot.send_message(
        m.chat.id,
        "🤍 مرحبًا بك\nاختر قسم الأذكار:",
        reply_markup=main_menu()
    )


@bot.callback_query_handler(func=lambda c: True)
def callbacks(c):
    uid = c.from_user.id
    chat_id = c.message.chat.id

    if c.data in ADHKAR:
        start_section(chat_id, uid, c.data)

    elif c.data == "misc":
        bot.send_message(chat_id, "✨ اختر نوع الأذكار:", reply_markup=misc_menu())

    elif c.data == "back":
        bot.send_message(chat_id, "اختر قسم الأذكار:", reply_markup=main_menu())

    elif c.data == "count":
        if uid not in USER_STATE:
            return

        USER_STATE[uid]["remaining"] -= 1

        if USER_STATE[uid]["remaining"] > 0:
            bot.edit_message_reply_markup(
                chat_id,
                c.message.message_id,
                reply_markup=counter_kb(USER_STATE[uid]["remaining"])
            )
        else:
            bot.edit_message_text("✔️ تم", chat_id, c.message.message_id)
            next_dhikr(chat_id, uid)

    bot.answer_callback_query(c.id)

# ==================================================
# RUN
# ==================================================

print("🤍 Dhikr Bot Running...")
bot.infinity_polling(skip_pending=True)
